# Pandas实例

## 1.基本操作

pandas库的版本

构造DataFrame

数据基本信息

选择列

选择行和列

数据筛选

修改元素值

列求和

分组求和

增加行

删除行

个数统计

列排序

数据转换map

数据替换replace

数据透视表

## 2.搭配操作

列元素去重

数据去重

列相减

极值索引

删除重复项

数据分段分组

## 3.数据清洗

构造杂乱数据

插值处理

字符串分割

标准化字符串

数据合并

文本匹配

列表展开

## 1.基本操作

pandas库的版本

In [407]:
import numpy as np
import pandas as pd
import warnings

# 打印出pandas 库的版本信息
pd.__version__

'1.4.1'

构造DataFrame

In [408]:
# 数据字典data 以及列表格式的标签数据labels
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [409]:
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

数据基本信息

In [410]:
df.info()  # 数据相关的基本信息
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

选择列

In [411]:
# 从 DataFrame `df` 选择标签为 `animal` 和 `age` 的列
df[["animal","age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [412]:
df.loc[:,["animal","age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

选择行和列

In [413]:
# 在 [3, 4, 8] 行中，列为 ['animal', 'age'] 的数据
df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [414]:
df.iloc[[3, 4, 8], [0, 1]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

数据筛选

In [415]:
# 选择列```visits``` 大于 1 的行
df[df['visits'] > 1]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
i    dog  7.0       2       no

In [416]:
# 选择 `age` 为缺失值的行
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [417]:
# 选择 `animal` 是cat且`age` 小于 3 的行
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [418]:
# 选择 `age` 在 2 到 4 之间的数据（包含边界值）
df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

修改元素值

In [419]:
# 将 'f' 行的 `age` 改为 1.5
df.loc['f', 'age'] = 1.5

列求和

In [420]:
# 对 `visits` 列的数据求和
df['visits'].sum()

19

分组求和

In [421]:
# 计算每种 `animal` `age` 的和
df.groupby('animal')['age'].sum()

animal
cat       7.0
dog      15.0
snake     5.0
Name: age, dtype: float64

增加行

In [375]:
# 新增一行数据 k，数据自定义
df.loc['k'] = [5.5, 'dog', 'no', 2]
df

  animal  age visits priority
a    cat  2.5      1      yes
b    cat  3.0      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog  5.0      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog  7.0      2       no
j    dog  3.0      1       no
k    5.5  dog     no        2

删除行

In [376]:
# 删除新追加的 k 行
df = df.drop('k', axis=0)
df

  animal  age visits priority
a    cat  2.5      1      yes
b    cat  3.0      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog  5.0      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog  7.0      2       no
j    dog  3.0      1       no

个数统计

In [377]:
# 统计每种 `animal` 的个数
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

列排序

In [378]:
# 先根据 `age` 降序排列，再根据 `visits` 升序排列
df.sort_values(by=['age', 'visits'], ascending=[False, True])  # 默认升序

  animal  age visits priority
i    dog  7.0      2       no
e    dog  5.0      2       no
g  snake  4.5      1       no
j    dog  3.0      1       no
b    cat  3.0      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

数据转换map

In [379]:
# 将 `priority` 列的 `yes` 和 `no` 用 `True` 和 `False` 替换
df['priority'] = df['priority'].map({'yes': True, 'no': False})  # 使用map方法将字符串转换为布尔值
df

  animal  age visits  priority
a    cat  2.5      1      True
b    cat  3.0      3      True
c  snake  0.5      2     False
d    dog  NaN      3      True
e    dog  5.0      2     False
f    cat  1.5      3     False
g  snake  4.5      1     False
h    cat  NaN      1      True
i    dog  7.0      2     False
j    dog  3.0      1     False

数据替换replace

In [380]:
# 将 `animal` 列的 `snake` 用 `python` 替换
df['animal'] = df['animal'].replace('snake', 'python')
df

   animal  age visits  priority
a     cat  2.5      1      True
b     cat  3.0      3      True
c  python  0.5      2     False
d     dog  NaN      3      True
e     dog  5.0      2     False
f     cat  1.5      3     False
g  python  4.5      1     False
h     cat  NaN      1      True
i     dog  7.0      2     False
j     dog  3.0      1     False

In [381]:
# df['animal'] = df['animal'].map({'python': 'snake'})  # map未写完类别, 其余的都被置为NaN
# df

数据透视表

In [382]:
# 对于每种 `animal` 和 `visit`，求出平均年龄。换句话说，每一行都是动物，每一列都是访问次数，其值是平均年龄
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

## 2.搭配操作

In [383]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

列元素去重

In [384]:
# `df`中`A`列出现的元素的唯一值（即：出现过的所有元素的集合）
df['A'].unique()

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

数据去重

In [386]:
# 将`df`进行数据降重
df.drop_duplicates(['A'])  # 只保留第一次出现的行

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

列相减

In [387]:
# 给定一组随机数据
df = pd.DataFrame(np.random.random(size=(5, 3))) 
df

          0         1         2
0  0.037486  0.180043  0.912930
1  0.725338  0.662832  0.476987
2  0.867451  0.024018  0.159824
3  0.904207  0.056992  0.989751
4  0.999571  0.753882  0.242666

In [388]:
# 使每个元素减去所在行的平均值
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.339334 -0.196777  0.536110
1  0.103619  0.041113 -0.144732
2  0.517020 -0.326413 -0.190607
3  0.253890 -0.593324  0.339434
4  0.334198  0.088509 -0.422707

极值索引

In [389]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.168601,0.127464,0.908444,0.671169,0.065614,0.813618,0.156878,0.835836,0.184001,0.693877
1,0.634308,0.995614,0.474918,0.220155,0.501734,0.998709,0.677391,0.861239,0.773673,0.718497
2,0.677616,0.528205,0.304397,0.763115,0.518687,0.932684,0.234959,0.914543,0.440101,0.093688
3,0.269063,0.803978,0.860866,0.311086,0.385759,0.142319,0.568204,0.221601,0.040397,0.568483
4,0.004922,0.087196,0.903715,0.926221,0.227701,0.440448,0.745172,0.114648,0.119256,0.658840

In [390]:
# 返回下列`df`数字总和最小那列的标签
# Pandas 里面的 idxmin 、idxmax函数与Numpy中 argmax、argmin 用法大致相同
df.sum().idxmin()  # idxmin()返回第一次出现的最小/最大值的索引

'i'

In [391]:
df.columns[np.argmin(df.sum())]  # argmin返回第一次出现的最小/最大值的索引

'i'

删除重复项

In [392]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
df

   0  1  2
0  0  0  1
1  1  0  1
2  0  1  0
3  1  0  0
4  1  1  0
5  1  0  1
6  0  1  0
7  0  1  1
8  0  1  0
9  0  1  1

In [393]:
# 计算一个 DataFrame 有多少不重复的行
df.drop_duplicates(keep=False)  # keep=False 删除所有重复项

   0  1  2
0  0  0  1
3  1  0  0
4  1  1  0

In [394]:
len(df.drop_duplicates(keep=False))

3

数据分段分组

In [395]:
df = pd.DataFrame(np.random.RandomState(1).randint(1, 4, size=(10, 2)), columns = ["A", "B"])  # np.random.RandomState(1).randint 左闭右开
df

   A  B
0  2  1
1  1  2
2  2  1
3  1  2
4  1  2
5  1  3
6  2  3
7  1  3
8  2  3
9  1  1

In [396]:
# 产生一个随机状态种子 np.random.RandomState(1).randint 左闭右开
df = pd.DataFrame(np.random.RandomState(1).randint(0, 101, 
                  size=(100, 2)), 
                  columns = ["A", "B"])
df

     A   B
0   37  12
1   72   9
2   75   5
3   79  64
4   16   1
..  ..  ..
95  71  53
96  69  36
97  21  40
98  77  91
99  49  47

[100 rows x 2 columns]

In [397]:
# 对 A 进行分段分组（i.e. (0, 10], (10, 20], ...），求每组内 B 的和。
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()  # pd.cut数据分段

A
(0, 10]      752
(10, 20]     475
(20, 30]     684
(30, 40]     161
(40, 50]     384
(50, 60]     839
(60, 70]     428
(70, 80]     615
(80, 90]     358
(90, 100]    300
Name: B, dtype: int32

## 3.数据清洗

构造杂乱数据

In [398]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

插值处理

**FlightNumber**列中的某些值缺失（它们是NaN）。

这些数字是有规律的，即每行增加 10，因此`NaN`需要放置 10055 和 10075。

修改`df`以填充这些缺失的数字并使该列成为整数列（而不是浮点列）

df.interpolate()

DataFrame.interpolate(method='linear', axis=0, limit=None, inplace=False, limit_direction='forward', limit_area=None, downcast=None, **kwargs)

method插值方式：

nearest：最邻近插值法

zero：阶梯插值

slinear、linear：线性插值

quadratic、cubic：2、3阶B样条曲线插值

In [399]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)  # 插值函数
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

字符串分割

**From_To**列作为两个单独的列会更好！

拆分下划线分隔符`_`前后的每个字符串. 将其拆分成两列，

存放在一个名为“temp”的临时 DataFrame，将列名 'From' 和 'To' 分配给这个临时DataFrame.

In [400]:
temp = df['From_To'].str.split('_', expand=True)
temp.columns = ['From', 'To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

标准化字符串

注意城市名称的大小写是混合在一起的。

只有第一个字母是大写的（例如“londON”应该变成“London”。）

In [401]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

数据合并

将`From_To`列从`df`中删去，将`temp`处理好的数据合并到`df`中

In [402]:
df = df.drop('From_To', axis=1)
df = df.join(temp)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

文本匹配

只提取航空公司名称。

在`AirLine`列中，您可以看到航空公司名称周围出现了一些额外的符号。

例如'(British Airways. )'应该变成'British Airways'.

In [403]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()  # 文本匹配数据方法extract
df

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

列表展开

在 RecentDelays 列中，值已作为列表输入到 DataFrame 中。我们希望每个第一个值在它自己的列中，每个第二个值在它自己的列中，依此类推。如果没有第 N 个值，则该值应为 NaN。

将 Series 列表展开为名为 的 DataFrame delays，重命名列delay_1，delay_2等等，并将不需要的 RecentDelays 列替换df为delays

In [405]:
delays = df['RecentDelays'].apply(pd.Series)
delays

C:\Users\29511_orbf8\AppData\Local\Temp\ipykernel_39136\139781484.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  delays = df['RecentDelays'].apply(pd.Series)

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [406]:
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]  # 列名重命名
df = df.drop('RecentDelays', axis=1).join(delays)  # 将新的列加入到原始数据中
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN